### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dev.google_app_engine_standard_app_version.fmltc-app-v1 will be updated in-place
!   resource "google_app_engine_standard_app_version" "fmltc-app-v1" {
        id                        = "apps/ftc-ml-firstinspires-dev/services/default/versions/v1"
        name                      = "apps/ftc-ml-firstinspires-dev/services/default/versions/v1"
        # (9 unchanged attributes hidden)

!       automatic_scaling {
!           min_pending_latency     = "0.100s" -> "0.1s"
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

!       deployment {

!           zip {
!               source_url  = "https://storage.googleapis.com/ftc-ml-firstinspires-dev-gae-source/e8f32c12768534175934f9fa74c0428f.zip" -> "https://storage.googleapis.com/ftc-ml-firstinspires-dev-gae-source/a92937a3679e0c02c13fe41c4f7b18a7.zip"
                # (1 unchanged attribute hidden)
            }
        }


!       handlers {
!           url_regex        = "/(.*\\.txt)" -> "/(.*\\.ico)"
            # (3 unchanged attributes hidden)

!           static_files {
!               mime_type             = "plain/text" -> "image/x-icon"
!               upload_path_regex     = "static/(.*\\.txt)" -> "static/(.*\\.ico)"
                # (5 unchanged attributes hidden)
            }
        }
!       handlers {
-           redirect_http_response_code = "REDIRECT_HTTP_RESPONSE_CODE_301" -> null
!           security_level              = "SECURE_ALWAYS" -> "SECURE_OPTIONAL"
!           url_regex                   = "/.*" -> "/(.*\\.png)"
            # (2 unchanged attributes hidden)

-           script {
-               script_path = "auto" -> null
            }

+           static_files {
+               expiration        = "0s"
+               mime_type         = "image/png"
+               path              = "static/\\1"
+               upload_path_regex = "static/(.*\\.png)"
            }
        }
!       handlers {
!           url_regex        = ".*" -> "/(.*\\.txt)"
            # (3 unchanged attributes hidden)

-           script {
-               script_path = "auto" -> null
            }

+           static_files {
+               expiration        = "0s"
+               mime_type         = "plain/text"
+               path              = "static/\\1"
+               upload_path_regex = "static/(.*\\.txt)"
            }
        }
!       handlers {
+           redirect_http_response_code = "REDIRECT_HTTP_RESPONSE_CODE_301"
!           security_level              = "SECURE_OPTIONAL" -> "SECURE_ALWAYS"
!           url_regex                   = ".*" -> "/.*"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
+       handlers {
+           auth_fail_action = "AUTH_FAIL_ACTION_REDIRECT"
+           login            = "LOGIN_OPTIONAL"
+           security_level   = "SECURE_OPTIONAL"
+           url_regex        = ".*"

+           script {
+               script_path = "auto"
            }
        }


        # (5 unchanged blocks hidden)
    }

  # module.dev.google_cloudfunctions_function.perform-action will be updated in-place
!   resource "google_cloudfunctions_function" "perform-action" {
        id                    = "projects/ftc-ml-firstinspires-dev/locations/us-central1/functions/perform_action"
        name                  = "perform_action"
!       source_archive_object = "55dfb69c6a330da0fa14208db11c488f.zip" -> "b7480324ae3cc2c966edcf9f7c4e93e3.zip"
        # (13 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.dev.google_storage_bucket_object.app-server-archive must be replaced
-/+ resource "google_storage_bucket_object" "app-server-archive" {
!       content_type     = "application/zip" -> (known after apply)
!       crc32c           = "5urTzg==" -> (known after apply)
!       detect_md5hash   = "6PMsEnaFNBdZNPn6dMBCjw==" -> "different hash" # forces replacement
-       event_based_hold = false -> null
!       id               = "ftc-ml-firstinspires-dev-gae-source-e8f32c12768534175934f9fa74c0428f.zip" -> (known after apply)
+       kms_key_name     = (known after apply)
!       md5hash          = "6PMsEnaFNBdZNPn6dMBCjw==" -> (known after apply)
!       media_link       = "https://storage.googleapis.com/download/storage/v1/b/ftc-ml-firstinspires-dev-gae-source/o/e8f32c12768534175934f9fa74c0428f.zip?generation=1661904668666108&alt=media" -> (known after apply)
-       metadata         = {} -> null
!       name             = "e8f32c12768534175934f9fa74c0428f.zip" -> "a92937a3679e0c02c13fe41c4f7b18a7.zip" # forces replacement
!       output_name      = "e8f32c12768534175934f9fa74c0428f.zip" -> (known after apply)
!       self_link        = "https://www.googleapis.com/storage/v1/b/ftc-ml-firstinspires-dev-gae-source/o/e8f32c12768534175934f9fa74c0428f.zip" -> (known after apply)
!       storage_class    = "STANDARD" -> (known after apply)
-       temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

  # module.dev.google_storage_bucket_object.cloud-function-archive must be replaced
-/+ resource "google_storage_bucket_object" "cloud-function-archive" {
!       content_type     = "application/zip" -> (known after apply)
!       crc32c           = "DRBqtw==" -> (known after apply)
!       detect_md5hash   = "Vd+2nGozDaD6FCCNsRxIjw==" -> "different hash" # forces replacement
-       event_based_hold = false -> null
!       id               = "ftc-ml-firstinspires-dev-gcf-source-55dfb69c6a330da0fa14208db11c488f.zip" -> (known after apply)
+       kms_key_name     = (known after apply)
!       md5hash          = "Vd+2nGozDaD6FCCNsRxIjw==" -> (known after apply)
!       media_link       = "https://storage.googleapis.com/download/storage/v1/b/ftc-ml-firstinspires-dev-gcf-source/o/55dfb69c6a330da0fa14208db11c488f.zip?generation=1661904668664231&alt=media" -> (known after apply)
-       metadata         = {} -> null
!       name             = "55dfb69c6a330da0fa14208db11c488f.zip" -> "b7480324ae3cc2c966edcf9f7c4e93e3.zip" # forces replacement
!       output_name      = "55dfb69c6a330da0fa14208db11c488f.zip" -> (known after apply)
!       self_link        = "https://www.googleapis.com/storage/v1/b/ftc-ml-firstinspires-dev-gcf-source/o/55dfb69c6a330da0fa14208db11c488f.zip" -> (known after apply)
!       storage_class    = "STANDARD" -> (known after apply)
-       temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

  # module.dev.module.serverless-connector.google_vpc_access_connector.connector_beta["central-serverless"] must be replaced
-/+ resource "google_vpc_access_connector" "connector_beta" {
!       id             = "projects/ftc-ml-firstinspires-dev/locations/us-central1/connectors/central-serverless" -> (known after apply)
!       max_instances  = 7 -> (known after apply)
!       min_instances  = 2 -> (known after apply)
        name           = "central-serverless"
-       network        = "ml-redis-vpc-dev" -> null # forces replacement
!       self_link      = "projects/ftc-ml-firstinspires-dev/locations/us-central1/connectors/central-serverless" -> (known after apply)
!       state          = "READY" -> (known after apply)
        # (5 unchanged attributes hidden)

!       subnet {
            name       = "serverless-subnet"
!           project_id = "ftc-ml-firstinspires-dev" -> (known after apply)
        }
    }

Plan: 3 to add, 2 to change, 3 to destroy.
```
</details>